# DocumentChangedEventArgs Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DocumentChangedEventArgs Properties
DocumentChangedEventArgs Class See Also
---
The DocumentChangedEventArgs type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Cancellable | Indicates whether an event may be cancelled by an event delegate.  (Inherited from RevitAPIEventArgs.) |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from RevitAPIEventArgs.) |
| Operation | The operation associated with this event |

# See Also
DocumentChangedEventArgs Class
Autodesk.Revit.DB.Events Namespace